#Область ВыгрузкаДанных
&НаСервере
Функция ВыгрузкаНаСервере()
	
	ТабДок1 = Новый ТабличныйДокумент;
	ТабДок2 = Новый ТабличныйДокумент;
	ТабДок3 = Новый ТабличныйДокумент;
	
	ТабДок = Обработки.ВыгрузкаXLSX.ПолучитьМакет("Макет");  
	ОбластьПараметров = ТабДок.ПолучитьОбласть("Номера");  
	ОбластьПараметров2 = ТабДок.ПолучитьОбласть("Постояльцы");
	ОбластьПараметров3 = ТабДок.ПолучитьОбласть("Бронь");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыНомеров.Код КАК Код,
	|	ТипыНомеров.Наименование КАК Наименование,
	|	ТипыНомеров.Количество КАК Количество,
	|	ТипыНомеров.Цена КАК Цена,
	|	ТипыНомеров.Описание КАК Описание
	|ИЗ
	|	Справочник.ТипыНомеров КАК ТипыНомеров";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из Результат Цикл 
		
		ОбластьПараметров.Параметры.Код = Стр.Код;
		ОбластьПараметров.Параметры.Наименование = Стр.Наименование;
		ОбластьПараметров.Параметры.Количество = Стр.Количество;  
		ОбластьПараметров.Параметры.Цена = Стр.Цена;
		ОбластьПараметров.Параметры.Описание = Стр.Описание;  
		
		ТабДок1.Вывести(ОбластьПараметров); 
		
	КонецЦикла; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Постояльцы.Код КАК Код,
	|	Постояльцы.Наименование КАК Наименование,
	|	Постояльцы.Телефон КАК Телефон,
	|	Постояльцы.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
	|	Постояльцы.Пол КАК Пол,
	|	Постояльцы.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.Постояльцы КАК Постояльцы";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из Результат Цикл 
		
		ОбластьПараметров2.Параметры.Код = Стр.Код;
		ОбластьПараметров2.Параметры.ФИО = Стр.Наименование;
		ОбластьПараметров2.Параметры.Телефон = Стр.Телефон;  
		ОбластьПараметров2.Параметры.АдресЭлектроннойПочты = Стр.АдресЭлектроннойПочты;
		ОбластьПараметров2.Параметры.Пол = Стр.Пол;
		ОбластьПараметров2.Параметры.ДатаРождения = Стр.ДатаРождения;    
		
		ТабДок2.Вывести(ОбластьПараметров2); 
		
	КонецЦикла;                      
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Бронирование.ДатаЗаезда КАК ДатаЗаезда,
	|	Бронирование.ДатаВыезда КАК ДатаВыезда,
	|	Бронирование.ТипНомера КАК ТипНомера,
	|	БронированиеПостояльцы.Постоялец КАК Постоялец,
	|	Бронирование.ЗавтракВключен КАК ЗавтракВключен
	|ИЗ
	|	Документ.Бронирование.Постояльцы КАК БронированиеПостояльцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Бронирование КАК Бронирование
	|		ПО БронированиеПостояльцы.Ссылка = Бронирование.Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из Результат Цикл 
		
		ОбластьПараметров3.Параметры.ДатаЗаезда = Стр.ДатаЗаезда;
		ОбластьПараметров3.Параметры.ДатаВыезда = Стр.ДатаВыезда;  
		ОбластьПараметров3.Параметры.ТипНомера = Стр.ТипНомера.Код;
		ОбластьПараметров3.Параметры.Постоялец = Стр.Постоялец.Код; 
		ОбластьПараметров3.Параметры.ЗавтракВключен = Стр.ЗавтракВключен;    
		
		ТабДок3.Вывести(ОбластьПараметров3); 
		
	КонецЦикла;  
	
	ТабДок.Присоединить(ТабДок1);		
	ТабДок.Присоединить(ТабДок2); 
	ТабДок.Присоединить(ТабДок3);
	
	Поток = Новый ПотокВПамяти;
	
	ТабДок.Записать(Поток, ТипФайлаТабличногоДокумента.XLSX);
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции 

&НаКлиенте
Процедура Выгрузка(Команда)
	
	Адрес = ВыгрузкаНаСервере();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(Адрес, "Выгрузка.xlsx", ПараметрыДиалога);
	
КонецПроцедуры
#КонецОбласти
